#create a df based on an array-like object

In [2]:
import pandas as pd
import numpy as np

In [6]:
students = pd.DataFrame(
    zip(
        
        ['Li', 'Wang', 'Zhang', 'Liu', 'Chen', 'Yang', 'Huang', 'Zhao', 'Wu', 'Zhou', 'Xu', 'Sun', 'Ma', 'Zhu', 'Hu'],
        np.random.choice(list('IJ'),15),#subclass
        np.random.choice(['male','female'],15),#gender
        np.random.randint(20,30,15),
        np.random.normal(80,5,15).round(1) #score
        
    ),
    columns = ['Name','Subclass','Gender','Age','Score']
)

In [7]:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      15 non-null     object
 1   Subclass  15 non-null     object
 2   Gender    15 non-null     object
 3   Age       15 non-null     int32
 4   Score     15 non-null     float64
dtypes: float64(1), int32(1), object(3)
memory usage: 672.0+ bytes

In [9]:
students['Letter'] = students["Score"].apply(lambda x: 'A' if x >=90 else 'B' if x >=80 else 'C' if x >=70 else 'D' if x >=60 else 'F')

In [10]:
students['Letter']

0     B
1     C
2     C
3     D
4     B
5     B
6     B
7     D
8     C
9     B
10    C
11    C
12    C
13    C
14    B
Name: Letter, dtype: object

In [11]:
students['Letter'].value_counts()

Letter
C    7
B    6
D    2
Name: count, dtype: int64

In [12]:
students['Score'].mask(students['Score']<90,'A')

0     A
1     A
2     A
3     A
4     A
5     A
6     A
7     A
8     A
9     A
10    A
11    A
12    A
13    A
14    A
Name: Score, dtype: object

In [14]:
students.groupby('Gender')['Score'].mean().sort_index(ascending = False)

Gender
female    76.528571
male      77.287500
Name: Score, dtype: float64

In [15]:
students.groupby(['Subclass','Gender'])['Score'].mean()

Subclass  Gender
I         female    71.766667
          male      76.383333
J         female    80.100000
          male      80.000000
Name: Score, dtype: float64

In [18]:
students.groupby(['Subclass','Gender'])['Score'].agg(['mean','std'])

                      mean       std
Subclass Gender
I        female  71.766667  3.139002
         male    76.383333  4.824279
J        female  80.100000  1.392839
         male    80.000000  0.848528

In [17]:
students.groupby(['Subclass','Gender'])['Letter'].value_counts()

Subclass  Gender  Letter
I         female  C         2
                  D         1
          male    C         3
                  B         2
                  D         1
J         female  B         3
                  C         1
          male    B         1
                  C         1
Name: count, dtype: int64

In [21]:
pd.crosstab(index = students['Gender'],
            columns=students['Letter']
            )
#by default,

Letter  B  C  D
Gender
female  3  3  1
male    3  4  1

In [22]:
students.pivot_table(index = 'Gender',
                     columns = 'Subclass',
                     values= 'Score',
                     aggfunc = 'mean'
                     )

Subclass          I     J
Gender
female    71.766667  80.1
male      76.383333  80.0

In [23]:
students.loc[4,['Age']],students.loc[8,'Score']=np.nan,np.nan

In [24]:
students.isnull().sum(axis = 0)

     Name  Subclass  Gender    Age  Score  Letter
0   False     False   False  False  False   False
1   False     False   False  False  False   False
2   False     False   False  False  False   False
3   False     False   False  False  False   False
4   False     False   False   True  False   False
5   False     False   False  False  False   False
6   False     False   False  False  False   False
7   False     False   False  False  False   False
8   False     False   False  False   True   False
9   False     False   False  False  False   False
10  False     False   False  False  False   False
11  False     False   False  False  False   False
12  False     False   False  False  False   False
13  False     False   False  False  False   False
14  False     False   False  False  False   False

In [26]:
students[students.isnull().any(axis = 1)]

   Name Subclass  Gender   Age  Score Letter
4  Chen        J  female   NaN   80.0      B
8    Wu        I    male  23.0    NaN      C

In [28]:
students['Score'].interpolate(method = 'bfill')

C:\Users\lenovo\AppData\Local\Temp\ipykernel_16584\2307692480.py:1: FutureWarning: Series.interpolate with method=bfill is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  students['Score'].interpolate(method = 'bfill')

0     80.2
1     72.9
2     70.7
3     69.3
4     80.0
5     81.2
6     80.6
7     68.6
8     81.9
9     81.9
10    79.4
11    75.3
12    78.5
13    76.6
14    80.0
Name: Score, dtype: float64